SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG23/Include/efr32fg23_synth.h
/* Bit fields for SYNTH LOCNTCTRL */
#define _SYNTH_LOCNTCTRL_RESETVALUE                   0x00000000UL                                    /**< Default value for SYNTH_LOCNTCTRL           */
#define _SYNTH_LOCNTCTRL_MASK                         0x00000FFFUL                                    /**< Mask for SYNTH_LOCNTCTRL                    */
#define SYNTH_LOCNTCTRL_ENABLE                        (0x1UL << 0)                                    /**< Enable LO Counter                           */
#define _SYNTH_LOCNTCTRL_ENABLE_SHIFT                 0                                               /**< Shift value for SYNTH_ENABLE                */
#define _SYNTH_LOCNTCTRL_ENABLE_MASK                  0x1UL                                           /**< Bit mask for SYNTH_ENABLE                   */
#define _SYNTH_LOCNTCTRL_ENABLE_DEFAULT               0x00000000UL                                    /**< Mode DEFAULT for SYNTH_LOCNTCTRL            */
#define _SYNTH_LOCNTCTRL_ENABLE_OFF                   0x00000000UL                                    /**< Mode OFF for SYNTH_LOCNTCTRL                */
#define _SYNTH_LOCNTCTRL_ENABLE_ON                    0x00000001UL                                    /**< Mode ON for SYNTH_LOCNTCTRL                 */
#define SYNTH_LOCNTCTRL_ENABLE_DEFAULT                (_SYNTH_LOCNTCTRL_ENABLE_DEFAULT << 0)          /**< Shifted mode DEFAULT for SYNTH_LOCNTCTRL    */
#define SYNTH_LOCNTCTRL_ENABLE_OFF                    (_SYNTH_LOCNTCTRL_ENABLE_OFF << 0)              /**< Shifted mode OFF for SYNTH_LOCNTCTRL        */
#define SYNTH_LOCNTCTRL_ENABLE_ON                     (_SYNTH_LOCNTCTRL_ENABLE_ON << 0)               /**< Shifted mode ON for SYNTH_LOCNTCTRL         */
#define SYNTH_LOCNTCTRL_CLEAR                         (0x1UL << 1)                                    /**< Clear LO Counter                            */
#define _SYNTH_LOCNTCTRL_CLEAR_SHIFT                  1                                               /**< Shift value for SYNTH_CLEAR                 */
#define _SYNTH_LOCNTCTRL_CLEAR_MASK                   0x2UL                                           /**< Bit mask for SYNTH_CLEAR                    */
#define _SYNTH_LOCNTCTRL_CLEAR_DEFAULT                0x00000000UL                                    /**< Mode DEFAULT for SYNTH_LOCNTCTRL            */
#define _SYNTH_LOCNTCTRL_CLEAR_OFF                    0x00000000UL                                    /**< Mode OFF for SYNTH_LOCNTCTRL                */
#define _SYNTH_LOCNTCTRL_CLEAR_ON                     0x00000001UL                                    /**< Mode ON for SYNTH_LOCNTCTRL                 */
#define SYNTH_LOCNTCTRL_CLEAR_DEFAULT                 (_SYNTH_LOCNTCTRL_CLEAR_DEFAULT << 1)           /**< Shifted mode DEFAULT for SYNTH_LOCNTCTRL    */
#define SYNTH_LOCNTCTRL_CLEAR_OFF                     (_SYNTH_LOCNTCTRL_CLEAR_OFF << 1)               /**< Shifted mode OFF for SYNTH_LOCNTCTRL        */
#define SYNTH_LOCNTCTRL_CLEAR_ON                      (_SYNTH_LOCNTCTRL_CLEAR_ON << 1)                /**< Shifted mode ON for SYNTH_LOCNTCTRL         */
#define SYNTH_LOCNTCTRL_RUN                           (0x1UL << 2)                                    /**< Run LO Counter                              */
#define _SYNTH_LOCNTCTRL_RUN_SHIFT                    2                                               /**< Shift value for SYNTH_RUN                   */
#define _SYNTH_LOCNTCTRL_RUN_MASK                     0x4UL                                           /**< Bit mask for SYNTH_RUN                      */
#define _SYNTH_LOCNTCTRL_RUN_DEFAULT                  0x00000000UL                                    /**< Mode DEFAULT for SYNTH_LOCNTCTRL            */
#define _SYNTH_LOCNTCTRL_RUN_OFF                      0x00000000UL                                    /**< Mode OFF for SYNTH_LOCNTCTRL                */
#define _SYNTH_LOCNTCTRL_RUN_ON                       0x00000001UL                                    /**< Mode ON for SYNTH_LOCNTCTRL                 */
#define SYNTH_LOCNTCTRL_RUN_DEFAULT                   (_SYNTH_LOCNTCTRL_RUN_DEFAULT << 2)             /**< Shifted mode DEFAULT for SYNTH_LOCNTCTRL    */
#define SYNTH_LOCNTCTRL_RUN_OFF                       (_SYNTH_LOCNTCTRL_RUN_OFF << 2)                 /**< Shifted mode OFF for SYNTH_LOCNTCTRL        */
#define SYNTH_LOCNTCTRL_RUN_ON                        (_SYNTH_LOCNTCTRL_RUN_ON << 2)                  /**< Shifted mode ON for SYNTH_LOCNTCTRL         */
#define SYNTH_LOCNTCTRL_READ                          (0x1UL << 3)                                    /**< Read LO Counter                             */
#define _SYNTH_LOCNTCTRL_READ_SHIFT                   3                                               /**< Shift value for SYNTH_READ                  */
#define _SYNTH_LOCNTCTRL_READ_MASK                    0x8UL                                           /**< Bit mask for SYNTH_READ                     */
#define _SYNTH_LOCNTCTRL_READ_DEFAULT                 0x00000000UL                                    /**< Mode DEFAULT for SYNTH_LOCNTCTRL            */
#define _SYNTH_LOCNTCTRL_READ_OFF                     0x00000000UL                                    /**< Mode OFF for SYNTH_LOCNTCTRL                */
#define _SYNTH_LOCNTCTRL_READ_ON                      0x00000001UL                                    /**< Mode ON for SYNTH_LOCNTCTRL                 */
#define SYNTH_LOCNTCTRL_READ_DEFAULT                  (_SYNTH_LOCNTCTRL_READ_DEFAULT << 3)            /**< Shifted mode DEFAULT for SYNTH_LOCNTCTRL    */
#define SYNTH_LOCNTCTRL_READ_OFF                      (_SYNTH_LOCNTCTRL_READ_OFF << 3)                /**< Shifted mode OFF for SYNTH_LOCNTCTRL        */
#define SYNTH_LOCNTCTRL_READ_ON                       (_SYNTH_LOCNTCTRL_READ_ON << 3)                 /**< Shifted mode ON for SYNTH_LOCNTCTRL         */
#define _SYNTH_LOCNTCTRL_NUMCYCLE_SHIFT               4                                               /**< Shift value for SYNTH_NUMCYCLE              */
#define _SYNTH_LOCNTCTRL_NUMCYCLE_MASK                0xF0UL                                          /**< Bit mask for SYNTH_NUMCYCLE                 */
#define _SYNTH_LOCNTCTRL_NUMCYCLE_DEFAULT             0x00000000UL                                    /**< Mode DEFAULT for SYNTH_LOCNTCTRL            */
#define _SYNTH_LOCNTCTRL_NUMCYCLE_CNT_2               0x00000000UL                                    /**< Mode CNT_2 for SYNTH_LOCNTCTRL              */
#define _SYNTH_LOCNTCTRL_NUMCYCLE_CNT_4               0x00000001UL                                    /**< Mode CNT_4 for SYNTH_LOCNTCTRL              */
#define _SYNTH_LOCNTCTRL_NUMCYCLE_CNT_8               0x00000002UL                                    /**< Mode CNT_8 for SYNTH_LOCNTCTRL              */
#define _SYNTH_LOCNTCTRL_NUMCYCLE_CNT_16              0x00000003UL                                    /**< Mode CNT_16 for SYNTH_LOCNTCTRL             */
#define _SYNTH_LOCNTCTRL_NUMCYCLE_CNT_32              0x00000004UL                                    /**< Mode CNT_32 for SYNTH_LOCNTCTRL             */
#define _SYNTH_LOCNTCTRL_NUMCYCLE_CNT_64              0x00000005UL                                    /**< Mode CNT_64 for SYNTH_LOCNTCTRL             */
#define _SYNTH_LOCNTCTRL_NUMCYCLE_CNT_128             0x00000006UL                                    /**< Mode CNT_128 for SYNTH_LOCNTCTRL            */
#define _SYNTH_LOCNTCTRL_NUMCYCLE_CNT_256             0x00000007UL                                    /**< Mode CNT_256 for SYNTH_LOCNTCTRL            */
#define _SYNTH_LOCNTCTRL_NUMCYCLE_CNT_512             0x00000008UL                                    /**< Mode CNT_512 for SYNTH_LOCNTCTRL            */
#define _SYNTH_LOCNTCTRL_NUMCYCLE_CNT_1024            0x00000009UL                                    /**< Mode CNT_1024 for SYNTH_LOCNTCTRL           */
#define _SYNTH_LOCNTCTRL_NUMCYCLE_CNT_2048            0x0000000AUL                                    /**< Mode CNT_2048 for SYNTH_LOCNTCTRL           */
#define _SYNTH_LOCNTCTRL_NUMCYCLE_CNT_4096            0x0000000BUL                                    /**< Mode CNT_4096 for SYNTH_LOCNTCTRL           */
#define _SYNTH_LOCNTCTRL_NUMCYCLE_CNT_8192            0x0000000CUL                                    /**< Mode CNT_8192 for SYNTH_LOCNTCTRL           */
#define SYNTH_LOCNTCTRL_NUMCYCLE_DEFAULT              (_SYNTH_LOCNTCTRL_NUMCYCLE_DEFAULT << 4)        /**< Shifted mode DEFAULT for SYNTH_LOCNTCTRL    */
#define SYNTH_LOCNTCTRL_NUMCYCLE_CNT_2                (_SYNTH_LOCNTCTRL_NUMCYCLE_CNT_2 << 4)          /**< Shifted mode CNT_2 for SYNTH_LOCNTCTRL      */
#define SYNTH_LOCNTCTRL_NUMCYCLE_CNT_4                (_SYNTH_LOCNTCTRL_NUMCYCLE_CNT_4 << 4)          /**< Shifted mode CNT_4 for SYNTH_LOCNTCTRL      */
#define SYNTH_LOCNTCTRL_NUMCYCLE_CNT_8                (_SYNTH_LOCNTCTRL_NUMCYCLE_CNT_8 << 4)          /**< Shifted mode CNT_8 for SYNTH_LOCNTCTRL      */
#define SYNTH_LOCNTCTRL_NUMCYCLE_CNT_16               (_SYNTH_LOCNTCTRL_NUMCYCLE_CNT_16 << 4)         /**< Shifted mode CNT_16 for SYNTH_LOCNTCTRL     */
#define SYNTH_LOCNTCTRL_NUMCYCLE_CNT_32               (_SYNTH_LOCNTCTRL_NUMCYCLE_CNT_32 << 4)         /**< Shifted mode CNT_32 for SYNTH_LOCNTCTRL     */
#define SYNTH_LOCNTCTRL_NUMCYCLE_CNT_64               (_SYNTH_LOCNTCTRL_NUMCYCLE_CNT_64 << 4)         /**< Shifted mode CNT_64 for SYNTH_LOCNTCTRL     */
#define SYNTH_LOCNTCTRL_NUMCYCLE_CNT_128              (_SYNTH_LOCNTCTRL_NUMCYCLE_CNT_128 << 4)        /**< Shifted mode CNT_128 for SYNTH_LOCNTCTRL    */
#define SYNTH_LOCNTCTRL_NUMCYCLE_CNT_256              (_SYNTH_LOCNTCTRL_NUMCYCLE_CNT_256 << 4)        /**< Shifted mode CNT_256 for SYNTH_LOCNTCTRL    */
#define SYNTH_LOCNTCTRL_NUMCYCLE_CNT_512              (_SYNTH_LOCNTCTRL_NUMCYCLE_CNT_512 << 4)        /**< Shifted mode CNT_512 for SYNTH_LOCNTCTRL    */
#define SYNTH_LOCNTCTRL_NUMCYCLE_CNT_1024             (_SYNTH_LOCNTCTRL_NUMCYCLE_CNT_1024 << 4)       /**< Shifted mode CNT_1024 for SYNTH_LOCNTCTRL   */
#define SYNTH_LOCNTCTRL_NUMCYCLE_CNT_2048             (_SYNTH_LOCNTCTRL_NUMCYCLE_CNT_2048 << 4)       /**< Shifted mode CNT_2048 for SYNTH_LOCNTCTRL   */
#define SYNTH_LOCNTCTRL_NUMCYCLE_CNT_4096             (_SYNTH_LOCNTCTRL_NUMCYCLE_CNT_4096 << 4)       /**< Shifted mode CNT_4096 for SYNTH_LOCNTCTRL   */
#define SYNTH_LOCNTCTRL_NUMCYCLE_CNT_8192             (_SYNTH_LOCNTCTRL_NUMCYCLE_CNT_8192 << 4)       /**< Shifted mode CNT_8192 for SYNTH_LOCNTCTRL   */
#define SYNTH_LOCNTCTRL_LOCNTOVERRIDEEN               (0x1UL << 8)                                    /**< Enable manual override of CLEAR and RUN     */
#define _SYNTH_LOCNTCTRL_LOCNTOVERRIDEEN_SHIFT        8                                               /**< Shift value for SYNTH_LOCNTOVERRIDEEN       */
#define _SYNTH_LOCNTCTRL_LOCNTOVERRIDEEN_MASK         0x100UL                                         /**< Bit mask for SYNTH_LOCNTOVERRIDEEN          */
#define _SYNTH_LOCNTCTRL_LOCNTOVERRIDEEN_DEFAULT      0x00000000UL                                    /**< Mode DEFAULT for SYNTH_LOCNTCTRL            */
#define _SYNTH_LOCNTCTRL_LOCNTOVERRIDEEN_DISABLE      0x00000000UL                                    /**< Mode DISABLE for SYNTH_LOCNTCTRL            */
#define _SYNTH_LOCNTCTRL_LOCNTOVERRIDEEN_ENABLE       0x00000001UL                                    /**< Mode ENABLE for SYNTH_LOCNTCTRL             */
#define SYNTH_LOCNTCTRL_LOCNTOVERRIDEEN_DEFAULT       (_SYNTH_LOCNTCTRL_LOCNTOVERRIDEEN_DEFAULT << 8) /**< Shifted mode DEFAULT for SYNTH_LOCNTCTRL    */
#define SYNTH_LOCNTCTRL_LOCNTOVERRIDEEN_DISABLE       (_SYNTH_LOCNTCTRL_LOCNTOVERRIDEEN_DISABLE << 8) /**< Shifted mode DISABLE for SYNTH_LOCNTCTRL    */
#define SYNTH_LOCNTCTRL_LOCNTOVERRIDEEN_ENABLE        (_SYNTH_LOCNTCTRL_LOCNTOVERRIDEEN_ENABLE << 8)  /**< Shifted mode ENABLE for SYNTH_LOCNTCTRL     */
#define SYNTH_LOCNTCTRL_LOCNTMANCLEAR                 (0x1UL << 9)                                    /**< Manual Control of LO counter CLEAR          */
#define _SYNTH_LOCNTCTRL_LOCNTMANCLEAR_SHIFT          9                                               /**< Shift value for SYNTH_LOCNTMANCLEAR         */
#define _SYNTH_LOCNTCTRL_LOCNTMANCLEAR_MASK           0x200UL                                         /**< Bit mask for SYNTH_LOCNTMANCLEAR            */
#define _SYNTH_LOCNTCTRL_LOCNTMANCLEAR_DEFAULT        0x00000000UL                                    /**< Mode DEFAULT for SYNTH_LOCNTCTRL            */
#define _SYNTH_LOCNTCTRL_LOCNTMANCLEAR_NOCLEAR        0x00000000UL                                    /**< Mode NOCLEAR for SYNTH_LOCNTCTRL            */
#define _SYNTH_LOCNTCTRL_LOCNTMANCLEAR_CLEAR          0x00000001UL                                    /**< Mode CLEAR for SYNTH_LOCNTCTRL              */
#define SYNTH_LOCNTCTRL_LOCNTMANCLEAR_DEFAULT         (_SYNTH_LOCNTCTRL_LOCNTMANCLEAR_DEFAULT << 9)   /**< Shifted mode DEFAULT for SYNTH_LOCNTCTRL    */
#define SYNTH_LOCNTCTRL_LOCNTMANCLEAR_NOCLEAR         (_SYNTH_LOCNTCTRL_LOCNTMANCLEAR_NOCLEAR << 9)   /**< Shifted mode NOCLEAR for SYNTH_LOCNTCTRL    */
#define SYNTH_LOCNTCTRL_LOCNTMANCLEAR_CLEAR           (_SYNTH_LOCNTCTRL_LOCNTMANCLEAR_CLEAR << 9)     /**< Shifted mode CLEAR for SYNTH_LOCNTCTRL      */
#define SYNTH_LOCNTCTRL_LOCNTMANRUN                   (0x1UL << 10)                                   /**< Manual Control of the LO counter RUN        */
#define _SYNTH_LOCNTCTRL_LOCNTMANRUN_SHIFT            10                                              /**< Shift value for SYNTH_LOCNTMANRUN           */
#define _SYNTH_LOCNTCTRL_LOCNTMANRUN_MASK             0x400UL                                         /**< Bit mask for SYNTH_LOCNTMANRUN              */
#define _SYNTH_LOCNTCTRL_LOCNTMANRUN_DEFAULT          0x00000000UL                                    /**< Mode DEFAULT for SYNTH_LOCNTCTRL            */
#define _SYNTH_LOCNTCTRL_LOCNTMANRUN_NORUN            0x00000000UL                                    /**< Mode NORUN for SYNTH_LOCNTCTRL              */
#define _SYNTH_LOCNTCTRL_LOCNTMANRUN_RUN              0x00000001UL                                    /**< Mode RUN for SYNTH_LOCNTCTRL                */
#define SYNTH_LOCNTCTRL_LOCNTMANRUN_DEFAULT           (_SYNTH_LOCNTCTRL_LOCNTMANRUN_DEFAULT << 10)    /**< Shifted mode DEFAULT for SYNTH_LOCNTCTRL    */
#define SYNTH_LOCNTCTRL_LOCNTMANRUN_NORUN             (_SYNTH_LOCNTCTRL_LOCNTMANRUN_NORUN << 10)      /**< Shifted mode NORUN for SYNTH_LOCNTCTRL      */
#define SYNTH_LOCNTCTRL_LOCNTMANRUN_RUN               (_SYNTH_LOCNTCTRL_LOCNTMANRUN_RUN << 10)        /**< Shifted mode RUN for SYNTH_LOCNTCTRL        */
#define SYNTH_LOCNTCTRL_FCALRUNCLKEN                  (0x1UL << 11)                                   /**< Enable FCAL run pulse counter clock         */
#define _SYNTH_LOCNTCTRL_FCALRUNCLKEN_SHIFT           11                                              /**< Shift value for SYNTH_FCALRUNCLKEN          */
#define _SYNTH_LOCNTCTRL_FCALRUNCLKEN_MASK            0x800UL                                         /**< Bit mask for SYNTH_FCALRUNCLKEN             */
#define _SYNTH_LOCNTCTRL_FCALRUNCLKEN_DEFAULT         0x00000000UL                                    /**< Mode DEFAULT for SYNTH_LOCNTCTRL            */
#define _SYNTH_LOCNTCTRL_FCALRUNCLKEN_DISABLE         0x00000000UL                                    /**< Mode DISABLE for SYNTH_LOCNTCTRL            */
#define _SYNTH_LOCNTCTRL_FCALRUNCLKEN_ENABLE          0x00000001UL                                    /**< Mode ENABLE for SYNTH_LOCNTCTRL             */
#define SYNTH_LOCNTCTRL_FCALRUNCLKEN_DEFAULT          (_SYNTH_LOCNTCTRL_FCALRUNCLKEN_DEFAULT << 11)   /**< Shifted mode DEFAULT for SYNTH_LOCNTCTRL    */
#define SYNTH_LOCNTCTRL_FCALRUNCLKEN_DISABLE          (_SYNTH_LOCNTCTRL_FCALRUNCLKEN_DISABLE << 11)   /**< Shifted mode DISABLE for SYNTH_LOCNTCTRL    */
#define SYNTH_LOCNTCTRL_FCALRUNCLKEN_ENABLE           (_SYNTH_LOCNTCTRL_FCALRUNCLKEN_ENABLE << 11)    /**< Shifted mode ENABLE for SYNTH_LOCNTCTRL     */

/* Bit fields for SYNTH LOCNTSTATUS */
#define _SYNTH_LOCNTSTATUS_RESETVALUE                 0x00000000UL                              /**< Default value for SYNTH_LOCNTSTATUS         */
#define _SYNTH_LOCNTSTATUS_MASK                       0x000FFFFFUL                              /**< Mask for SYNTH_LOCNTSTATUS                  */
#define _SYNTH_LOCNTSTATUS_LOCOUNT_SHIFT              0                                         /**< Shift value for SYNTH_LOCOUNT               */
#define _SYNTH_LOCNTSTATUS_LOCOUNT_MASK               0x7FFFFUL                                 /**< Bit mask for SYNTH_LOCOUNT                  */
#define _SYNTH_LOCNTSTATUS_LOCOUNT_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for SYNTH_LOCNTSTATUS          */
#define SYNTH_LOCNTSTATUS_LOCOUNT_DEFAULT             (_SYNTH_LOCNTSTATUS_LOCOUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for SYNTH_LOCNTSTATUS  */
#define SYNTH_LOCNTSTATUS_BUSY                        (0x1UL << 19)                             /**< LO Counter is Busy                          */
#define _SYNTH_LOCNTSTATUS_BUSY_SHIFT                 19                                        /**< Shift value for SYNTH_BUSY                  */
#define _SYNTH_LOCNTSTATUS_BUSY_MASK                  0x80000UL                                 /**< Bit mask for SYNTH_BUSY                     */
#define _SYNTH_LOCNTSTATUS_BUSY_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for SYNTH_LOCNTSTATUS          */
#define SYNTH_LOCNTSTATUS_BUSY_DEFAULT                (_SYNTH_LOCNTSTATUS_BUSY_DEFAULT << 19)   /**< Shifted mode DEFAULT for SYNTH_LOCNTSTATUS  */

/* Bit fields for SYNTH LOCNTTARGET */
#define _SYNTH_LOCNTTARGET_RESETVALUE                 0x00000000UL                             /**< Default value for SYNTH_LOCNTTARGET         */
#define _SYNTH_LOCNTTARGET_MASK                       0x0007FFFFUL                             /**< Mask for SYNTH_LOCNTTARGET                  */
#define _SYNTH_LOCNTTARGET_TARGET_SHIFT               0                                        /**< Shift value for SYNTH_TARGET                */
#define _SYNTH_LOCNTTARGET_TARGET_MASK                0x7FFFFUL                                /**< Bit mask for SYNTH_TARGET                   */
#define _SYNTH_LOCNTTARGET_TARGET_DEFAULT             0x00000000UL                             /**< Mode DEFAULT for SYNTH_LOCNTTARGET          */
#define SYNTH_LOCNTTARGET_TARGET_DEFAULT              (_SYNTH_LOCNTTARGET_TARGET_DEFAULT << 0) /**< Shifted mode DEFAULT for SYNTH_LOCNTTARGET  */

/* Bit fields for SYNTH MMDDENOMINIT */
#define _SYNTH_MMDDENOMINIT_RESETVALUE                0x00000000UL                                   /**< Default value for SYNTH_MMDDENOMINIT        */
#define _SYNTH_MMDDENOMINIT_MASK                      0x07FFFFFFUL                                   /**< Mask for SYNTH_MMDDENOMINIT                 */
#define _SYNTH_MMDDENOMINIT_DENOMINIT0_SHIFT          0                                              /**< Shift value for SYNTH_DENOMINIT0            */
#define _SYNTH_MMDDENOMINIT_DENOMINIT0_MASK           0x1FFUL                                        /**< Bit mask for SYNTH_DENOMINIT0               */
#define _SYNTH_MMDDENOMINIT_DENOMINIT0_DEFAULT        0x00000000UL                                   /**< Mode DEFAULT for SYNTH_MMDDENOMINIT         */
#define SYNTH_MMDDENOMINIT_DENOMINIT0_DEFAULT         (_SYNTH_MMDDENOMINIT_DENOMINIT0_DEFAULT << 0)  /**< Shifted mode DEFAULT for SYNTH_MMDDENOMINIT */
#define _SYNTH_MMDDENOMINIT_DENOMINIT1_SHIFT          9                                              /**< Shift value for SYNTH_DENOMINIT1            */
#define _SYNTH_MMDDENOMINIT_DENOMINIT1_MASK           0x3FE00UL                                      /**< Bit mask for SYNTH_DENOMINIT1               */
#define _SYNTH_MMDDENOMINIT_DENOMINIT1_DEFAULT        0x00000000UL                                   /**< Mode DEFAULT for SYNTH_MMDDENOMINIT         */
#define SYNTH_MMDDENOMINIT_DENOMINIT1_DEFAULT         (_SYNTH_MMDDENOMINIT_DENOMINIT1_DEFAULT << 9)  /**< Shifted mode DEFAULT for SYNTH_MMDDENOMINIT */
#define _SYNTH_MMDDENOMINIT_DENOMINIT2_SHIFT          18                                             /**< Shift value for SYNTH_DENOMINIT2            */
#define _SYNTH_MMDDENOMINIT_DENOMINIT2_MASK           0x7FC0000UL                                    /**< Bit mask for SYNTH_DENOMINIT2               */
#define _SYNTH_MMDDENOMINIT_DENOMINIT2_DEFAULT        0x00000000UL                                   /**< Mode DEFAULT for SYNTH_MMDDENOMINIT         */
#define SYNTH_MMDDENOMINIT_DENOMINIT2_DEFAULT         (_SYNTH_MMDDENOMINIT_DENOMINIT2_DEFAULT << 18) /**< Shifted mode DEFAULT for SYNTH_MMDDENOMINIT */

/* Bit fields for SYNTH CHPDACINIT */
#define _SYNTH_CHPDACINIT_RESETVALUE                  0x00000000UL                             /**< Default value for SYNTH_CHPDACINIT          */
#define _SYNTH_CHPDACINIT_MASK                        0x00000FFFUL                             /**< Mask for SYNTH_CHPDACINIT                   */
#define _SYNTH_CHPDACINIT_DACINIT_SHIFT               0                                        /**< Shift value for SYNTH_DACINIT               */
#define _SYNTH_CHPDACINIT_DACINIT_MASK                0xFFFUL                                  /**< Bit mask for SYNTH_DACINIT                  */
#define _SYNTH_CHPDACINIT_DACINIT_DEFAULT             0x00000000UL                             /**< Mode DEFAULT for SYNTH_CHPDACINIT           */
#define SYNTH_CHPDACINIT_DACINIT_DEFAULT              (_SYNTH_CHPDACINIT_DACINIT_DEFAULT << 0) /**< Shifted mode DEFAULT for SYNTH_CHPDACINIT   */

